<h1>Шифр "Марк"</h1>
<?php
	error_reporting(0);
	$key = mb_strtolower(file_get_contents('key5.txt'));
	//Считывание русских букв
	function mbStringToArray($string, $encoding = 'UTF-8'){
		$strlen = mb_strlen($string);
		while($strlen){
			$array[] = mb_substr($string, 0, 1, $encoding);
			$string = mb_substr($string, 1, $strlen, $encoding);
			$strlen = mb_strlen($string, $encoding);
		}
		return ($array);
	}
	
	$t0  = array ('a','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я');
	$t1  = array ('б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','a');
	$t2  = array ('в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б');
	$t3  = array ('г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в');
	$t4  = array ('д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г');
	$t5  = array ('е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д');
	$t6  = array ('ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е');
	$t7  = array ('ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё');
	$t8  = array ('з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж');
	$t9  = array ('и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з');
	$t10 = array ('й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и');
	$t11 = array ('к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й');
	$t12 = array ('л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к');
	$t13 = array ('м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л');
	$t14 = array ('н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м');
	$t15 = array ('о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н');
	$t16 = array ('п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о');
	$t17 = array ('р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п');
	$t18 = array ('с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р');
	$t19 = array ('т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с');
	$t20 = array ('у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т');
	$t21 = array ('ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у');
	$t22 = array ('х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф');
	$t23 = array ('ц','ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х');
	$t24 = array ('ч','ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц');
	$t25 = array ('ш','щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч');
	$t26 = array ('щ','ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш');
	$t27 = array ('ъ','ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ');
	$t28 = array ('ы','ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ');
	$t29 = array ('ь','э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы');
	$t30 = array ('э','ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь');
	$t31 = array ('ю','я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э');
	$t32 = array ('я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю');
	
	$t = array($t0, $t1, $t2, $t3, $t4, $t5, $t6, $t7, $t8, $t9, $t10, $t11, $t12, $t13, $t14, $t15, $t16, $t17, $t18, $t19, $t20, $t21, $t22, $t23, $t24, $t25, $t26, $t27, $t28, $t29, $t30, $t31, $t32); 
        
	//Считывание из файла
	$text1 = file_get_contents('index11.txt');
	$text = mbStringToArray(mb_strtolower($text1));
	$key = mbStringToArray($key);
	
	echo "<br><b>Ключ: </b>";
	for($i = 0; $i < count($key); $i++){
		echo $key[$i]; 
	}
	echo "<br><b>Строка: </b>";
	echo $text1;
	
    $length = count($text);
	$jj = 0;
	
	echo "<br><br><b>Таблица: </b><br>";
	echo "<table border='1'>";
	echo "<tr>";
	for($j = 0; $j < $length; $j++){
		echo "<td style='padding: 3px;'>".$key[$jj]."</td>";
		$row1[$j] = $key[$jj];
		if($jj + 1 == count($key)){
			$jj = 0;
		}
		else{
			$jj++;
		}
	}
	echo "</tr>";
	echo "<tr>";
	for($j = 0; $j < $length; $j++){
		$row2[$j] = $text[$j];
		echo "<td style='padding: 3px;'>".$text[$j]."</td>";
	}
	echo "</tr>";
	echo "</table>";
        
	//Шифрование
	echo "<br><br><b>Зашифрованное: </b>";
	for($j = 0; $j < $length; $j++){
		$r1 = $row1[$j];
		
		$stroka = $stolbec = "";
		if(preg_match('/[а-я]+/i', $row2[$j]) == 1){
			if($r1 == "а") $stolbec = 0;
			elseif($r1 == "б") $stolbec = 1;
			elseif($r1 == "в") $stolbec = 2;
			elseif($r1 == "г") $stolbec = 3;
			elseif($r1 == "д") $stolbec = 4;
			elseif($r1 == "е") $stolbec = 5;
			elseif($r1 == "ё") $stolbec = 6;
			elseif($r1 == "ж") $stolbec = 7;
			elseif($r1 == "з") $stolbec = 8;
			elseif($r1 == "и") $stolbec = 9;
			elseif($r1 == "й") $stolbec = 10;
			elseif($r1 == "к") $stolbec = 11;
			elseif($r1 == "л") $stolbec = 12;
			elseif($r1 == "м") $stolbec = 13;
			elseif($r1 == "н") $stolbec = 14;
			elseif($r1 == "о") $stolbec = 15;
			elseif($r1 == "п") $stolbec = 16;
			elseif($r1 == "р") $stolbec = 17;
			elseif($r1 == "с") $stolbec = 18;
			elseif($r1 == "т") $stolbec = 19;
			elseif($r1 == "у") $stolbec = 20;
			elseif($r1 == "ф") $stolbec = 21;
			elseif($r1 == "х") $stolbec = 22;
			elseif($r1 == "ц") $stolbec = 23;
			elseif($r1 == "ч") $stolbec = 24;
			elseif($r1 == "ш") $stolbec = 25;
			elseif($r1 == "щ") $stolbec = 26;
			elseif($r1 == "ъ") $stolbec = 27;
			elseif($r1 == "ы") $stolbec = 28;
			elseif($r1 == "ь") $stolbec = 29;
			elseif($r1 == "э") $stolbec = 30;
			elseif($r1 == "ю") $stolbec = 31;
			elseif($r1 == "я") $stolbec = 32;
			else{}
			
			for($i = 0; $i < 33; $i++){
				if($t[$i][$stolbec] == $row2[$j]){
					$r2 = $i;
					break;
				}
			}
			
			if($r2 == 0) $stroka = "а";
			elseif($r2 == 1) $stroka = "б";
			elseif($r2 == 2) $stroka = "в";
			elseif($r2 == 3) $stroka = "г";
			elseif($r2 == 4) $stroka = "д";
			elseif($r2 == 5) $stroka = "е";
			elseif($r2 == 6) $stroka = "ё";
			elseif($r2 == 7) $stroka = "ж";
			elseif($r2 == 8) $stroka = "з";
			elseif($r2 == 9) $stroka = "и";
			elseif($r2 == 10) $stroka = "й";
			elseif($r2 == 11) $stroka = "к";
			elseif($r2 == 12) $stroka = "л";
			elseif($r2 == 13) $stroka = "м";
			elseif($r2 == 14) $stroka = "н";
			elseif($r2 == 15) $stroka = "о";
			elseif($r2 == 16) $stroka = "п";
			elseif($r2 == 17) $stroka = "р";
			elseif($r2 == 18) $stroka = "с";
			elseif($r2 == 19) $stroka = "т";
			elseif($r2 == 20) $stroka = "у";
			elseif($r2 == 21) $stroka = "ф";
			elseif($r2 == 22) $stroka = "х";
			elseif($r2 == 23) $stroka = "ц";
			elseif($r2 == 24) $stroka = "ч";
			elseif($r2 == 25) $stroka = "ш";
			elseif($r2 == 26) $stroka = "щ";
			elseif($r2 == 27) $stroka = "ъ";
			elseif($r2 == 28) $stroka = "ы";
			elseif($r2 == 29) $stroka = "ь";
			elseif($r2 == 30) $stroka = "э";
			elseif($r2 == 31) $stroka = "ю";
			elseif($r2 == 32) $stroka = "я";
			else{}
			
			echo $stroka;
		}
		else{
			echo $row2[$j];
		}
	}
?>